Tekla Open API Reference for Tekla Structures 2025
TextFile Constructor
Overload List
Name | Description
TextFile(ViewBase, Point, String)
 Creates a new text file instance using standard attributes.
TextFile(ViewBase, Point, String, Size)
 Creates a new text file instance using standard attributes.
TextFile(ViewBase, Point, String, TextFile.TextFileAttributes)
 Creates a new text file instance using specific attributes.
TextFile(ViewBase, Point, String, Size, TextFile.TextFileAttributes)
 Creates a new text file instance using specific attributes.
Top
See Also
Reference
TextFile Class
Tekla.Structures.Drawing Namespace